{
    "projects": [
        {
            "image": "/assets/projects/socratesForm.png",
            "image2": "/assets/projects/socratesForm.png",
            "title": {
                "FR": "Formulaire Socrates",
                "EN": "Socrates Form",
                "IT": "Modulo Socrate"
            },
            "description": {
                "FR": "Cyber Socrates est un questionnaire vidéo interactif qui aide les utilisateurs à définir l’identité visuelle de leur projet ainsi que leur client type. Les réponses sont envoyées via EmailJS, ce qui me permet d’y accéder tout en garantissant leur anonymat (hors adresse email). En retour, chaque participant reçoit par email un document personnalisé généré avec l’aide de ChatGPT, incluant une proposition d’identité visuelle cohérente et un persona client détaillé. Ce projet combine vidéo, réflexion stratégique et intelligence artificielle pour offrir une expérience à la fois ludique et utile.",
                "EN": "Cyber Socrates is an interactive video questionnaire that helps users define the visual identity of their project as well as their typical client. The answers are sent via EmailJS, which allows me to access them while ensuring their anonymity (except for the email address). In return, each participant receives a personalized document by email generated with the help of ChatGPT, including a proposal for a coherent visual identity and a detailed client persona. This project combines video, strategic thinking, and artificial intelligence to provide an experience that is both fun and useful.",
                "IT": "Cyber Socrates è un questionario video interattivo che aiuta gli utenti a definire l'identità visiva del loro progetto e il loro cliente tipo. Le risposte vengono inviate tramite EmailJS, il che mi consente di accedervi garantendo l'anonimato (tranne per l'indirizzo email). In cambio, ogni partecipante riceve via email un documento personalizzato generato con l'aiuto di ChatGPT, che include una proposta di identità visiva coerente e un persona cliente dettagliato. Questo progetto combina video, riflessione strategica e intelligenza artificiale per offrire un'esperienza sia ludica che utile."
            },
            "technologies": ["React", "EmailJS", "ChatGPT"],
            "github": "https://github.com/MaTor97/socrates",
            "demo": "https://socratesform.netlify.app"
        },
        {
            "image": "/assets/projects/SolarSystem.webp",
            "image2": "/assets/projects/SolarSystem.png",
            "title": {
                "FR": "Système Solaire",
                "EN": "Solar System",
                "IT": "Sistema Solare"
            },
            "description": {
                "FR": "Collection de cartes contenant des informations sur chaque planète du système solaire. Les informations s'affichent en cliquant sur la carte, elles proviennent de l'application même, dans un objet construit pour l'occasion.",
                "EN": "Collection of cards containing information about each planet in the solar system. The information is displayed by clicking on the card, it comes from the application itself, in an object built for the occasion.",
                "IT": "Collezione di carte contenenti informazioni su ogni pianeta del sistema solare. Le informazioni vengono visualizzate cliccando sulla carta, provengono dall'applicazione stessa, in un oggetto costruito per l'occasione."
            },
            "technologies": ["JavaScript", "CSS", "Netlify"],
            "github": "https://github.com/MaTor97/solar_system",
            "demo": "https://solar-sy.netlify.app"
        },
        {
            "image": "/assets/projects/pokedex.webp",
            "image2": "/assets/projects/pokedex.png",
            "title": {
                "FR": "Pokedex",
                "EN": "Pokedex",
                "IT": "Pokedex"
            },
            "description": {
                "FR": "Application permettant de rechercher des pokémons par nom ou par numéro. Les informations s'affichent en cliquant sur la carte et le site est responsive, elles proviennent de pokéApi et d'autres urls pour les images.",
                "EN": "Application allowing to search for pokémons by name or number. The information is displayed by clicking on the card and the site is responsive, it comes from pokéApi and other urls for the images.",
                "IT": "Applicazione che permette di cercare pokémon per nome o numero. Le informazioni vengono visualizzate cliccando sulla carta e il sito è responsive, provengono da pokéApi e altri url per le immagini."
            },
            "technologies": ["React", "API", "Netlify"],
            "github": "https://github.com/MaTor97/pokedex",
            "demo": "https://pokedex-becode.netlify.app"
        },
        {
            "image": "/assets/projects/taskManager.webp",
            "image2": "/assets/projects/taskManager.png",
            "title": {
                "FR": "Agenda",
                "EN": "Task Manager",
                "IT": "Agenda"
            },
            "description": {
                "FR": "Application permettant de gérer des tâches. Les tâches sont stockées dans le local storage et peuvent être supprimées ou marquées comme terminées. Le site est responsive.",
                "EN": "Application allowing to manage tasks. Tasks are stored in local storage and can be deleted or marked as completed. The site is responsive.",
                "IT": "Applicazione che permette di gestire le attività. Le attività sono memorizzate nel local storage e possono essere eliminate o contrassegnate come completate. Il sito è responsive."
            },
            "technologies": ["React", "Local Storage", "Netlify"],
            "github": "https://github.com/MaTor97/react_to_do_list",
            "demo": "https://to-do-list-becode.netlify.app"
        }
        
    ]
}